Revit 2026 API
gbXMLBuildingOperatingSchedule Enumeration
 Enumerations for gbXML (Green Building XML) format, used for energy analysis, schema version 0.34.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public enum gbXMLBuildingOperatingSchedule
Public Enumeration gbXMLBuildingOperatingSchedule
public enum class gbXMLBuildingOperatingSchedule
type gbXMLBuildingOperatingSchedule
Members
Member name | Value | Description
DefaultOperatingSchedule | 0
KindergartenThruTwelveGradeSchool | 7
NoOfOperatingScheduleEnums | 11
TheaterPerformingArts | 9
TwelveHourFiveDayFacility | 6
TwelveHourSevenDayFacility | 4
TwelveHourSixDayFacility | 5
TwentyFourHourHourFiveDayFacility | 3
TwentyFourHourHourSixDayFacility | 2
TwentyFourHourSevenDayFacility | 1
Worship | 10
YearRoundSchool | 8
Remarks
 This enumeration corresponds to the buildingType attribute in gbXML and is used to specify the building operating schedule.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace